Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/ced.en.utf8.tmx
Source language: en
Languages: chr

source: My brother works at Pryor.
chr: ᎫᏩᏲ ᏫᏚᎸᏫᏍᏓᏁᎰ ᏦᏍᏓᏓᏅᏟ.

source: What are you planning to do July fourth?
chr: ᎦᏙ ᏣᏛᏁᏗ ᏕᏧᎪᏗ ᎫᏰᏉᎾ ᏅᎩᏁᎢ?

source: I have a coon dog for sale.
chr: ᎬᏟ ᏧᏲᎯ ᎩᏟ ᎠᎩᏍᎪᎵᏗ.

source: I thought he was hiding, but he was standing in view.
chr: ᎤᏗᏍᎦᏝ ᎡᎵᏍᎬ ᎠᏎᏅ ᎬᏂᎨᏒ ᏓᎦᏙᎬᎢ.

source: This farmer raises peaches and sells them.
chr: ᎯᎠᏗᎦᎶᎩᏍᎩ ᏆᎾ ᏓᏛᎯᏍᏗᏍᎪ ᏕᎦᎾᏕᎪᎢᏃ.

source: We saw a six-foot cobra.
chr: ᏑᏓᎵ ᎢᎳᏏᏗ ᎢᎦᏅᎯᏓ ᏆᎾᏓᏲᎭ ᎣᏥᎪᏩᏔ.

source: Every summer my mother picks plums and cans them.
chr: ᎪᎩ ᏱᏄᎵᏍᏔᎾ ᏆᏄᎾᏍᏗᎢ ᏕᎦᏕᏍᎪ ᎡᏥ ᎠᎴ ᏕᎦᎶᏗᏍᎪᎢ.

source: You can hear locusts in the heat of the summer.
chr: ᎪᎩ ᎤᏗᏞᎩ ᏗᏛᎪᏗ ᎾᏂᏪᏍᎬ ᎶᎶ.

source: Here! Here is the money I owe you!
chr: Ꮎ! ᎠᎭᏂ ᎠᏕᎳ ᏥᏍᎩᏚᎦ.

source: Where did you put those wheels?
chr: ᎭᏢ ᏕᎯᎲᎦ Ꮎ ᏗᎦᏆᏘᏗ.

source: You're not going until then?
chr: ᎾᎯᏳᎢᏍ ᎩᎳ ᏖᏏ?

source: There are five workers.
chr: ᎯᏍᎩ ᎾᏂᎠ ᏧᏂᎸᏫᏍᏓᏁᎯ.

source: Go stand near him.
chr: ᏗᎦᏙᎬ ᎾᎥ ᏩᎴᎲᎦ.

source: Do you know how to make hominy?
chr: ᎯᎦᏔᎭᏍ ᏁᏩᏓ ᏦᏢᏗ?

source: Look! Who's that coming?
chr: Ꮒ! ᎦᎪ ᏥᏓᏯᎢ?

source: All the people heard him speak.
chr: ᏂᎦᏓ ᏴᏫ ᎬᏩᏛᎦᏅ ᎦᏬᏂᏍᎬᎢ.

source: Have you already forgotten what he said? A cat is meowing.
chr: ᎦᏳᎳᏍ ᏨᎨᏫᏎ ᏄᏪᏒᎢ? ᏪᏌ ᏂᎦᏪᎠ.

source: He's always playing ball during the summer.
chr: ᏂᎪᎯᎸ ᎠᎳᏍᎦᎵᏍᎪ ᎪᎩ ᏱᎩ.

source: Take your watch off before you dive into the water.
chr: ᏅᏅᏓᎩ ᏩᏥ Ꮟ ᎠᎹᏱ ᏫᏂᏣᏕᏘᏅᎾ.

source: He put a lock on the door.
chr: ᏓᎩᏏ ᏄᏩᏅᏔᏅ ᎦᎶᎯᏍᏗᎢ.

source: He wants to talk to you.
chr: ᏂᎯ ᏍᏓᏟᏃᎮᏗ ᎤᏚᎵᎭ.

source: She says she hurts all over. She likes to go everywhere.
chr: ᏂᎬ ᎤᏪᎯᏍᏓᏁᎵᏙᎭ ᎠᏗᎭ. ᏂᎬ ᎤᏪᏙᎵᏓᏍᏗ ᎤᎸᏉᏗ.

source: They want you two to go now.
chr: ᏃᏊ ᏍᏕᏅᏍᏗ ᎤᎾᏚᎵᎭ.

source: They might come tomorrow and then they might not.
chr: ᏯᏂᎷᎩᏊ ᏑᎾᎴ ᏃᏊᎴ ᏄᏂᎷᏨᎾᏊ ᏱᎩ.

source: They make lumber out of pine.
chr: ᏧᏯᏖᎾ ᏓᏃᏢᏗᏍᎪᎢ ᏃᏥ.

source: There are a lot of stars out tonight.
chr: ᏥᏈᏍᏗ ᏃᏈᏏ ᎠᏂᎧᎳ ᎪᎯ ᎤᏒᎢ.

source: When the streets freeze over, the road maintenance crews dump sand on them.
chr: ᏕᎦᎳᏅᏛ ᏱᏚᏁᏍᏓᎳᏓ ᏃᏯ ᎠᏂᎳᎨᏯᏛᏍᎪᎢ ᏅᏃᎯ ᏧᏂᎸᏫᏍᏓᏁᎯ.

source: Willy has a different car.
chr: ᏫᎵ ᏄᏓᎴ ᏓᏆᎴᎳ ᎤᎭ.

source: You are really crazy.
chr: ᏙᏳ ᏂᏣᏓᏅᏛᎾ.

source: Tell him to come as quickly as possible.
chr: ᏄᏟᏍᏛ ᏤᏒ ᎯᏲᏎᎸᎢ.

source: Hurry or we'll be late.
chr: ᏄᎳ, ᏓᎩᏂᎪᏂᏲᏥᏍ.

source: Come here. I want to tell you something.
chr: ᏄᎳ. ᎪᎱᏍᏗ ᎬᏃᎯᏎᏗ ᎠᏆᏚᎵ.

source: He has twenty acres of potatoes planted.
chr: ᏔᎵᏍᎪᎯ ᎢᏳᏟᎶᏓ ᎢᎬᎾᏕᎾ ᏚᏫᏌ ᏄᎾ.

source: What do you have on your arm?
chr: ᎦᏙ ᎤᏍᏗ ᏂᏨᏅᏗ ᎯᏃᎨᏂ?

source: When are you going to New York?
chr: ᎯᎳ ᎢᏴ ᏖᏏ ᏄᏯᎩ?

source: The sun is bigger than the moon.
chr: ᎢᎦ ᎡᎯ ᏅᏓ ᎤᎪᏗ ᎤᏔᎾ ᏏᏅ ᏒᏃᏱ ᎡᎯ ᏅᏓ ᎨᏒᎢ.

source: It starts getting cold in the month of November.
chr: ᏅᏓᏕᏆ ᎧᎸ ᎠᏓᎴᏂᏍᎪ ᎤᏴᏢᎢ.

source: Where is a calender?
chr: ᎭᏢ ᏅᏓ ᏗᏎᏍᏗ?

source: I went to Texas during my vacation.
chr: ᏅᏓᎩ ᏩᏇᏙᎸ ᏙᎢ ᎨᏙᎲ ᎢᎪᎯᏓ.

source: Do you believe that man has been on the moon?
chr: ᏦᎯᏳᎭᏍ ᏅᏙᎯ ᎤᏪᏙᎸ ᎨᏒ ᏴᏫ?

source: He runs four miles every morning.
chr: ᏅᎩ ᎢᏳᏟᎶᏓ ᎠᏓᎾᏫᏍᏗᏍᎪ ᏂᏚᎩᏨᏂᏒᎢ.

source: Some workers have a day off on the fourth of July.
chr: ᎫᏰᏉᎾ ᏅᎩᏁ ᏙᎢ ᎠᏁᏙᎰ ᎢᎦᏓ ᏧᏂᎸᏫᏍᏓᏁᎯ.

source: Come back on Thursday.
chr: ᏅᎩᏁ ᎢᎦ ᎢᎮᏙᎸᎢ.

source: Someone is walking in the middle of the road.
chr: ᏅᏃᎯ ᎠᏰᏟ ᎠᎢ ᎩᎶᎢ.

source: Let's live in peace.
chr: ᏅᏩᏙᎯᏯᏓ ᎢᏕᎮᏍᏘ.

source: I want medicine for a cold.
chr: ᎤᏴᏜ ᎣᏂᎣᏍᎬ ᏅᏬᏘ ᎠᏆᏚᎵᎭ.

source: Don't drink the rubbing alcohol.
chr: ᏞᏍᏗ ᏥᎭᏗᏔᎯ Ꮎ ᏅᏬᏘ ᎠᏓᎯᎯ.

source: The rocks were too heavy to lift if no one helped.
chr: ᏗᎦᎨᏗ ᎨᏒ ᏗᏌᎳᏙᏗ ᏅᏯ ᎩᎶ ᏃᏍᏕᎵᏍᎬᎾ ᏱᎩ.

source: He lives in a house made of bricks.
chr: ᏅᏯ ᏗᏛᏓᏅᎢ ᎠᏁᏍᎨᏔᏅ ᎠᏓᏁᎸ ᎦᏁᎳ.

source: She lives in a place called Rocky Mountain. He made a garden in a rocky place.
chr: ᏅᏲᎯ ᎣᏓᎸ ᏚᏙᎥ ᎦᏁᎳ. ᏅᏲᎯ ᎤᏬᏢᏅ ᏠᎨᏏ.

source: Eagles live high atop the mountains.
chr: ᏙᏓᎸ ᎦᎸᎳᏗ ᎠᏁᎰ ᎠᏬᎭᎵ.

source: Oklahoma means "red man" in the Choctaw language.
chr: ᎣᎦᎳᎰᎹ ᏥᎩ "ᎩᎦᎨ ᎠᏍᎦᏯ" ᎠᏗᎭ ᎠᏂᏣᏓ ᎤᏂᏬᏂᎯᏍᏗ.

source: That man traps groundhogs.
chr: Ꮎ ᎠᏍᎦᏯ ᎣᎦᎾ ᏓᏌᏛᎥᏍᎪᎢ.

source: Hand me the face soap.
chr: Ꮎ ᎣᏝ ᎠᎬᏍᏉᏍᏙᏗ ᎡᏍᎬᏏ.

source: He came afterwards.
chr: ᎣᏂ ᎤᎷᏨᎢ.

source: Stand behind me.
chr: ᏥᏙᎬ ᎣᏂ ᏗᏜ ᎯᏙᎨᏍᏗ.

source: This meat is good to eat. He speaks well.
chr: ᎯᎠ ᎭᏫᏯ ᎣᏍᏓ ᎠᎩᏍᏗ. ᎣᏍᏓ ᎦᏬᏂ.

source: He's a preacher of the good news.
chr: ᎣᏍᏓ ᎧᏃᎮᏓ ᎠᎵᏣᏙᎲᏍᎩ.

source: I'm doing fairly well.
chr: ᎣᏏ ᎾᏆᏛᎿᏕᎦ.

source: Where shall I set this stove?
chr: ᎭᏢ ᏓᏥᎧᏂ ᎯᎠ ᎣᏏ?

source: She won a new range in a contest.
chr: ᎢᏤ ᎣᏍ ᎠᏓᏍᏓᏴᏗ ᎤᏓᏒᏅ ᎠᎾᏓᎪᎾᏘᏗᏍᎬᎢ.

source: He's cutting wood for a heating stove.
chr: ᎣᏏ ᎠᎦᎾᏬᎯᏍᏗ ᏗᎲᏘᏗ ᎠᏓ ᏓᏍᏆᎸᏍᎦ.

source: Do you feel all right?
chr: ᎣᏏᏊᏍ ᏣᏓᏅᏔ?

source: Hello. Are you well?
chr: ᎣᏏᏲ. ᏙᎯᏧ?

source: He catches rabbits with traps.
chr: ᏗᏌᏛᏗ ᎬᏗ ᏕᎦᏂᏱᏍᎪ ᏥᏍᏚ.

source: Count from one to twenty.
chr: ᏔᏎᎦ ᏌᏊ ᏂᏛᎴᏂᏍᎩ ᏔᎵᏍᎪᎯ ᏩᏍᏘ.

source: He's wearing a blue cap.
chr: ᏌᎪᏂᎨ ᎤᎵᏑᏫᏓ ᎤᎵᏍᏚᎳ.

source: Possums like to eat persimmons.
chr: ᎤᎾᏤᏥᏍᏗ ᏌᎵ ᏧᏂᎩᏍᏗ ᎤᏂᎸᏉᏗ.

source: I hooked a snapping turtle while I was fishing at the pond.
chr: ᏌᎵᎫᎩ ᏥᏰᏒ ᎥᏓᎵ ᎦᏑᎲᏍᎬᎢ.

source: I shot a squirrel with a .22 rifle.
chr: ᏔᎵᏦᏁ ᎬᏗ ᏥᏲᎸ ᏌᎶᎵ.

source: Geese head south when it turns winter.
chr: ᏧᎦᏃᏮ ᎾᎾᏛᎾᏗᏍᎪ ᏌᏌ ᎪᎳ ᏱᏄᎵᏍᏔᎾ.

source: This rock is hard. He's working hard.
chr: ᎯᎠ ᏅᏯ ᏍᏓᏯ. ᏍᏓᏯ ᏚᎸᏫᏍᏓᏁ.

source: They have a swing made of rope.
chr: ᏍᏕᏱᏓ ᎪᏢᏔᏅ ᎠᏓᏁᏐᎳᏕᏗ ᎤᏃᏢᎭ.

source: They were a little tired from playing ball.
chr: ᏍᏗᎩᏓ ᏚᏂᏯᏪᎬᎢ ᏍᏆᎴᏍᏗ ᏚᎾᏁᎶᏅᎢ.

source: Close the gate when the cows go by.
chr: ᎯᏍᏚᏅ ᏍᏚᏗ Ꮎ ᏩᎦ ᎠᏂᎶᏐᏅᎢ.

source: A key is for unlocking a door.
chr: ᏍᏚᎢᏍᏗ ᎦᎶᎯᏍᏗ ᎠᏍᏚᎢᏍᏙᏗ.

source: If you haven't been confronted by Satan today, it's possible you two are walking in the same direction.
chr: ᏎᏓᏂ ᏗᏣᏠᏒ ᏂᎨᏒᎾ ᏱᎩ ᎪᎯ ᎢᎦ, ᎡᎵᏊ ᎢᏣᎳᎭ ᏱᏍᏓᎢ.

source: Some dressers are made of walnut.
chr: ᎢᎦᏓ ᏗᏎᎯᏍᏗ ᏎᏗ ᎠᏓ ᏗᎪᏢᏔᏅ ᎨᏐᎢ.

source: It's difficult to see a green snake in the grass.
chr: ᏎᎳᏉᏯ ᏍᏓᏱ ᎠᎪᏮᏛᏗ ᎦᏄᎸᏒᎢ.

source: How much corn did you raise this summer?
chr: ᎯᎳ ᎢᎦ ᏎᎷ ᏕᎭᏛᎯᏍᏓ ᎪᎯ ᎪᎩ

source: The farmer is planting some popcorn.
chr: Ꮎ ᏗᎦᎶᎩᏍᎩ ᏎᎷ ᎠᎾᏔᏍᎩᏍᎩ ᏓᏫᏍᎦ.

source: He accidentally spilled a sack of corn meal.
chr: ᏎᎷ ᎢᏌ ᎦᏅᏛ ᎤᏤᏩᏍᏙᏔᏅᎢ.

source: He's burning some dry corncobs.
chr: ᏎᎷ ᏧᏓ ᏧᎧᏲᏓ ᏓᎪᎲᏍᏗᎭ.

source: I watch the news at ten o'clock each night on my television set.
chr: ᏍᎪᎯ ᎢᏳᏩᏂᎸ ᏂᏚᎵᏏᏂᏒ ᎦᎦᏙᏍᏗᏍᎪ ᎧᏃᎮᏓ ᎠᏓᏴᎳᏛᏍᎩ ᎠᎩᎲᎢ.

source: He's coming back the tenth of next month.
chr: ᏍᎪᎯᏁ ᏐᎢᎧᎴᏍᏗ ᏛᎦᎷᏥ.

source: There were about a hundred people.
chr: Ꮲ ᏍᎪᎯᏥᏍᏆ ᎾᏂᎥ ᏴᏫ.

source: The children want to play ball.
chr: Ꮎ ᏗᏂᏲᏟ ᏍᏆᎴᏍᏗ ᏧᎾᏁᎶᏗ ᎤᎾᏚᎵᎭ.

source: He went to New Mexico while on his vacation.
chr: ᏍᏆᏂᏤᏍᏛ ᏭᏪᏙᎸ ᏙᎢ ᎡᏙᎲ ᎢᎪᎯᏓ.

source: The boys fought with their fists.
chr: ᏗᏍᏇᏅ ᎬᏗ ᎤᎾᏟᎸ ᎠᏂᏧᏣ.

source: I am working today, and I will work tomorrow also.
chr: ᎪᎯ ᎢᎦ ᏓᎩᎸᏫᏍᏓᏁᎭ, ᏑᎾᎴᏅ ᎥᏍᏊ ᏙᏛᎩᎸᏫᏍᏓᏁᎵ.

source: Isn't he back yet?
chr: ᏝᏍ Ꮟ ᏱᎦᎷᎦ?

source: He went to his sister's home for one day.
chr: ᏏᎦ ᏭᏪᏙᎸ ᎤᏙ ᏧᏪᏅᏒᎢ.

source: I hear katydids.
chr: ᏍᎩᎩ ᎾᏂᏪᏍᎬ ᎦᏛᎩᎠ.

source: I heard yesterday that he was supposed to speak again today. I want more water.
chr: ᏒᎯ ᎠᏆᏛᎦᏅ ᏏᏊ ᏗᎦᏬᏂᏏᏒ ᎪᎯ ᎢᎦ. ᏏᏊ ᎠᏆᏚᎵ ᎠᎹ.

source: How much does that pig weigh?
chr: ᎯᎳ ᎢᏳᏓᎨᏓ Ꮎ ᏏᏆ?

source: A new car is better than an old one.
chr: ᎢᏤ ᏓᏆᏪᎳ ᏓᏤᏝ ᏏᏅ ᎤᏪᏘ ᎨᏒᎢ.

source: They took one month in building the house.
chr: ᏏᏅᏓ ᎤᏂᎯᎵᏙᎸ ᎦᎵᏦᏕ ᎠᏀᏁᏍᎨᏍᎬᎢ.

source: He's standing on the other side fishing.
chr: ᏍᎪᏂ ᏗᎦᏙᎦ ᏗᏑᎲᏍᎦ.

source: Did you have to go overseas when you were in the service?
chr: ᏍᎪᏂᏱᏍ ᏫᏤᏓᏍᏗ ᏄᎵᏍᏔᏁ ᎠᏂᏲᏍᎩ ᏥᏯᎥᎢ?

source: They're racing horses.
chr: ᏐᏈᎵ ᏓᎾᏙᎩᏯᏍᏗᎭ.

source: He's plowing with a mule.
chr: ᏐᏈᎵ ᏗᎦᎴᏅᎢᏓ ᎬᏗ ᎦᏓᎷᎩᎠ.

source: He picks hickory nuts in the fall.
chr: ᏐᎯ ᏕᎫᎡᏍᎪ ᎤᎵᎪᎲᏍᏗ.

source: I have to see the doctor tomorrow at nine o'clock.
chr: ᏐᏁᎳ ᎢᏳᏩᏂᎸ ᏑᎾᎴ ᏥᎪᏮᏛᏗ ᎦᎾᎦᏘ.

source: Do you want to be the ninth?
chr: ᏐᏁᎵᏁᎢᏍ ᏱᏣᎵᏍᏙᏗ ᏣᏚᎵᎭ?

source: He went in another room. Give me another one.
chr: ᏐᎢ ᏗᎧᏅᏑᎸ ᏩᏴᎭ. ᏏᏊ ᏐᎢ ᏥᏍᎬᏏ.

source: Set this chair in the next room.
chr: ᏐᎢᏱ ᏫᏍᎩᎳᏓ ᎯᎠ ᎦᏍᎩᎶ.

source: I want to say one thing.
chr: ᏑᏓᎴᎩ ᎢᏯᎩᏪᏍᏗ ᎠᏆᏚᎵ.

source: The alarm clock wakes him up at six o'clock in the morning.
chr: ᏑᏓᎵ ᎢᏳᏩᏂᎸ ᏑᎾᎴ ᏗᏜ ᎤᏰᎢᏍᏙᏍᎪᎢ ᏩᏥ.

source: He hasn't been here since the sixth of last month.
chr: ᏑᏓᎵᏁ ᏐᎢ ᏥᎧᎸ ᎬᏪᏙᎸᎢ.

source: I bought this watch one year ago.
chr: ᏑᏕᏘᏴᏓ ᏥᎨᏒᎥ ᏣᎩᏩᏒ ᎯᎠ ᏩᏥ.

source: After she made the dough, she put it in the oven.
chr: ᏑᎨᏓ ᎤᏬᏢᏃᎿ, ᏗᎦᏘᏗ ᏭᏝᏅᎢ.

source: I want two fishhooks.
chr: ᏔᎵᎭ ᏗᏑᏗ ᏓᏆᏚᎵᎭ.

source: It took him two hours to pick a gallon of blackberries.
chr: ᏔᎵ ᎢᏳᏟᎶᏓ ᎤᎯᎵᏙᎸ ᏑᏟᎶᏓ ᎧᏄᎦᏟ ᎦᏕᏍᎬᎢ.

source: The buzzards are eating something dead.
chr: ᎪᎱᏍᏗ ᎤᎵᏬᏨ ᎠᏂᏰᎠ ᏑᎵ.

source: Our meeting is scheduled for tomorrow at two o'clock.
chr: ᏑᎾᎴ ᏔᎵ ᏳᏩᏂᎸ ᏥᎨᏎᏍᏗ ᏓᏒᏍᏗ ᏗᎦᏠᎯᏍᏗᎢ.

source: Come in the morning.
chr: ᏑᎾᎴ ᏗᏜ ᎯᎷᏨᎢ.

source: I'll see you tomorrow evening.
chr: ᏑᎾᎴ ᏒᎯᏰᏱ ᎢᎬᎪᎥᎢ.

source: Stay overnight the next time you come.
chr: ᏑᏒᎯᏓ ᎮᏙᎸ ᏔᎵᏁᎢ ᎢᏁᏙᎸᎢ.

source: The barrel filled up with rainwater when it rained.
chr: ᏒᏙᏂ ᎤᎧᎵᏨ ᎤᎦᎿᏅ ᎠᎹ ᎤᎦᎿᎾ.

source: When she peels onions it makes her cry.
chr: ᏒᎩ ᏱᏚᏁᎦᎸᎭ ᎤᏠᏱᏍᏗᏍᎪᎢ.

source: Where were you yesterday?
chr: ᎭᏢ ᎮᏙᎮ ᏒᎯ ᏥᎨᏒᎢ?

source: I came over for a while yesterday morning.
chr: ᏒᎯ ᏑᎾᎴ ᏥᎨᏒ ᏞᎦ ᎠᏇᏙᎸᎢ.

source: I finished bailing hay yesterday evening.
chr: ᏒᎯ ᏒᎯᏰᏱ ᎠᏱᏍᏆᏛ ᎧᏁᏍᎦ ᏕᏥᏍᏓᏴᏗᏍᎬᎢ.

source: Did it rain night before last?
chr: ᎤᎦᎿᏁᎢᏍ ᏒᎯ ᎤᏒᎢ?

source: He mows the grass in the evening.
chr: ᏒᎯᏰᏱ ᎠᎦᎵᏍᎪ ᎦᏄᎸ.

source: He bought some apples in town.
chr: ᏒᎦᏔ ᏚᏩᏒ ᏗᎦᏚᎲᎢ.

source: One week is not long.
chr: ᏒᎾᏙᏓᏆᏍᏗ Ꮭ ᎪᎯᏓ ᏱᎨᏐᎢ.

source: At midnight I will leave.
chr: ᏒᏃᏱ ᎠᏰᏟ ᏓᎦᏁᎳᏗ.

source: He bought two pairs of shoes.
chr: ᏔᎵ ᎢᏗᎳᏑᎶ ᏚᏩᎯ.

source: My birthday is on April second.
chr: ᎧᏬᏂ ᏔᎵᏁ ᎠᏆᏕᏘᏱᏍᎩ.

source: Are you going to work on Tuesday?
chr: ᏙᏓᏣᎸᏫᏍᏓᏁᎵᏍ ᏔᎵᏁ ᎢᎦ?

source: Cans get rusty if water is left in them too long.
chr: ᏓᏯᏍᎳᏗᏍᎪ ᏔᎷᎩᏍᎩ ᏯᎪᎯᎳ ᎠᎹ ᏱᏓᎵᏍᏗ.

source: Is your brother a welder?
chr: ᏔᎷᎩᏍᎩᏍ ᏗᎧᏅᏫᏍᎩ ᏚᏍᏓᏓᏅᏟ?

source: He ran out of solder.
chr: ᏔᎷᎩᏍᎩ ᏗᎧᏅᏬᏙᎯ ᎤᏨᎲᏏ.

source: What do you make baskets out of?
chr: ᎦᏙ ᎤᏍᏗ ᏕᎰᏢᏗᏍᎪ ᏗᏔᎷᏣ?

source: How many tomatoes do you want?
chr: ᎯᎳ ᎢᎦ ᏔᎹᏟ ᏕᏣᏚᎵᎭ?

source: A hawk is sitting on a post.
chr: ᎨᏛ ᎤᎩᎳ ᏔᏬᏗ.

source: You can see a lot of toads by a pond.
chr: ᎥᏓᎷᎵᏗ ᏥᏍᏈᏍᏗ ᏱᏛᎪᏩᏔ ᏖᎦ.

source: If people don't wash their hair, they get lice.
chr: ᏴᏫ ᎾᎾᎵᏍᏚᎴᏍᎬᎾ ᏱᎩ ᏘᎾ ᎬᏩᏂᎸᎪᎢ.

source: A blacksnake caught a lizard.
chr: ᏘᏲᎭᎵ ᎦᏂᏯ ᎦᎴᎩ.

source: Have you ever seen an eel?
chr: ᎢᎸᎯᏳᎢᏍ ᎯᎪᎥ ᏢᏕᏆ?

source: I heard that you weren't well.
chr: ᏙᎯ ᏂᎨᏒᎾ ᎨᏒ ᎬᏯᏛᎦᏅ.

source: I am just fine, and you?
chr: ᏙᎯᏊ ᎠᏴ, ᏂᎯᎾ?

source: When he told them to be still, they became quiet.
chr: Ꮩ ᏂᏣᏛᎦ ᏚᏬᏎᎳ, ᎡᏝᏪ ᏄᎾᎵᏍᏔᏅᎢ.

source: The redbird is smaller than the bluejay.
chr: ᏙᏧᏮᎠ ᎤᏍᏗᎧ ᏏᏅ Ꮎ ᏜᏴᎦ ᎨᏒᎢ.

source: In the summer you can see a lot of grasshoppers.
chr: ᎪᎩ ᏥᏍᏈᏍᏗ ᏗᎪᏮᏛᏗ ᏙᎳᏥᎦ.

source: Do you believe there are ghosts?
chr: ᏦᎯᏳᎭᏍ ᎠᏂᏥᎩᎵ ᎠᏁᎲ?

source: Look! There's a bug on the bush.
chr: Ꮒ! ᏥᎪᏯ ᎤᎩᎳ ᎤᏩᎢᏢᎢ.

source: I hear a whippoorwill every night close to the house.
chr: ᏥᏆᎴᏆᎳ ᏂᎦᏪᏍᎬ ᎦᏛᎩᏍᎪ ᏧᎵᏏᏅᏓ ᎠᏓᏁᎸ ᎾᎥᎢ.

source: She talks a lot when she feels well. I see many white men.
chr: ᏥᏈᏍᏗ ᎦᏬᏂᏍᎪ ᎣᏍᏓ ᏳᏓᏅᏔ. ᏥᏈᏍᏗ ᎠᏂᏲᏁᎦ ᎦᏥᎪᏮᏘᎭ.

source: She had her tonsils taken out at the hospital.
chr: ᏚᎴᏥ ᏂᏓᎬᏅᏓᎡᎸ ᏧᏂᏢᎩᎢ.

source: He's putting medicine on his boil.
chr: ᏅᏬᏘ ᎦᏅᎵᏰᎠ ᏚᏍᏗ ᎤᏜᎥᎢ.

source: What kind of beans are these?
chr: ᎦᏙ ᎤᎾᏍᏗ ᏚᏯ ᎯᎠ?

source: Close the door, you're letting the flies in.
chr: ᎯᏍᏚᎲᎦ ᎦᎶᎯᏍᏗᎢ, ᏛᎦ ᏕᎯᏴᏗᎭ.

source: He was asked to pray.
chr: ᎤᏓᏙᎵᏍᏙᏗ ᎠᏥᏔᏲᏎᎸᎢ.

source: I guess he really loved her.
chr: ᎤᏙᎯᏳ ᎠᏎ ᎤᏓᎨᏳᏎᎢ.

source: I didn't know he was an ordained minister.
chr: Ꮭ ᏯᏆᏅᏖ ᎤᏓᏂᎳᎨ ᎨᏒᎢ.

source: Which is the oldest one?
chr: ᎦᏙ ᎤᏍᏗ ᏥᎩ ᎤᏓᏂᎳᎨᎢ?

source: He's really a reckless boy.
chr: ᎤᏙᎯᏳ ᎤᏓᏣᏘᏗ ᎠᏧᏣ.

source: Cherokees say that if you hear a crow at night, it's a bad omen.
chr: ᎪᎦ ᏂᎦᏪᏍᎬ ᏯᏛᎦᎾ ᎤᏒ, ᎤᏓᎴᎯ ᎠᎾᏗᏍᎪ ᎠᏂᏣᎳᎩ.

source: His wife is my cousin.
chr: ᎤᏓᎵᎢ ᎪᎱᏍᏗ ᎠᏋᏂ.

source: That boy is really snobbish.
chr: ᎤᏙᎯᏳ ᎤᏓᎸᏉᏗ Ꮎ ᎠᏧᏣ.

source: What did the store owner give you?
chr: ᎦᏙ ᎤᏍᏗ ᏨᏏ Ꮎ ᎤᏓᎾᏂ?

source: The old woman's skin is wrinkled.
chr: Ꮎ ᎠᎦᏴᎵᎨ ᎤᏁᎦᎸ ᎤᏓᏁᎪᏳᎭ.

source: A bird is bathing in a puddle of water.
chr: ᎠᎹ ᎤᏓᏁᎲ ᎠᏓᏬᎠ ᏥᏍᏆ.

source: His heart stopped on him.
chr: ᎤᏓᏅᏙ ᎤᎴᏫᏍᏓᏁᎸᎢ.

source: I feel all right now.
chr: ᎣᏏᏊᏛ ᎠᏆᏓᏅᏔ ᏃᏊ.

source: He is very pleasant to talk with.
chr: ᎤᏙᏳ ᎤᏓᏅᏘ ᎠᏟᏃᎮᏙᏗ.

source: He has a tamed raccoon.
chr: ᎤᏓᏅᏘᏌᏅ ᎬᏟ ᎤᎾᏝᎠ.

source: He always keeps his room clean.
chr: ᏂᎪᎯᎸ ᎤᏓᏅᎦᎸᏓ ᏄᏩᏃ ᎤᏴᏍᏗᎢ.

source: He walked a long way.
chr: ᎤᏓᏅᎯᏓ ᎡᎳᏗ ᎤᏂᎩᏒᎢ.

source: He's walking between two rows of potatoes.
chr: ᏄᎾ ᏚᏓᏅᏅ ᎠᏰᏟ ᎠᎢ.

source: Breaking the law leads to punishment.
chr: ᎤᏓᏍᏛᏗᏍᏗ ᎨᏒ ᏩᏟᎢᎶᎯᎭ ᏱᏛᏲᏍᏗ ᏗᎧᏃᏩᏛᏍᏗ.

source: The workers are resting in the shade.
chr: ᎤᏓᏩᏗᏍᎬ ᎤᎾᏓᏪᏐᎸᏍᏗ ᏧᏂᎸᏫᏍᏓᏁᎯ.

source: Something is in view in the bushes.
chr: ᎪᎱᏍᏗ ᎤᏓᏴᎳᏔ ᏚᏩᎢᏢᎢ.

source: Tomorrow throw the trash away.
chr: ᏑᎾᎴ ᎤᏟ ᏫᏣᏕᏒ Ꮎ ᎤᏲ ᎦᎵᏛᎢ.

source: How many pitchers do you all have?
chr: ᎯᎳ ᎾᏂᎠ ᎤᎾᏕᎩ ᏕᏥᎧᎭ?

source: He's causing embarrassment by doing that.
chr: ᎤᏕᎰᎯᏍᏗ ᎪᏢᏍᎦ ᏥᎾᏛᏁᎭ.

source: She has a bashful boy.
chr: ᎤᏕᎰᏌᏘ ᎠᏧᏣ ᎤᏩᎧᎭ.

source: Can you help me get my car out of a ditch?
chr: ᎡᎵᏊᏍ ᏱᏍᎩᏍᏕᎳ ᎤᏕᎵᏍᎦᎸᎲ ᎦᎴᏒ ᏓᏆᎴᎳ?

source: Today my brother is having a birthday.
chr: ᎪᎯ ᎢᎦ ᎤᏕᏘᏱᎭ ᏦᏍᏓᏓᏅᏟ.

source: Tighten those bolts.
chr: ᏘᏍᏓᏱᏓ Ꮎ ᏧᏗᏆᎸᏕᏱᏓ.

source: It's really hot today.
chr: ᏙᏳ ᎤᏗᏞᎦ ᎪᎯ ᎢᎦ.

source: The patient had a high fever.
chr: Ꮎ ᎤᏢᎩ ᏥᏈᏍᏗ ᎤᏗᏞᎲᏍᎬᎢ.

source: Where is he hiding?
chr: ᎭᏢ ᎤᏗᏍᎦᏝ?

source: When he got some medicine, he got well fast.
chr: ᏅᏬᏘ ᎤᎩᏌ, ᎦᏣᏄᎵ ᎤᏗᏫᏒᎢ.

source: His shirt was so small his navel was showing.
chr: ᎤᏍᏗᎩ ᎤᏄᏮ ᎢᏳᏍᏗ ᎤᏗᏴᏓᏛ ᎤᎦᏌᏛᎢ.

source: There is a job opening at the clothing manufacturers.
chr: ᏗᎿᏬ ᏧᏃᏢᏗ ᎤᏜᏅᏓ ᏗᎦᎸᏫᏍᏓᏁᏗᎢ.

source: I'll have time to come to visit you next month.
chr: ᏐᎢ ᎧᎴᏍᏗ ᎠᏆᏜᏅᏓᏕᎮᏍᏗ ᏫᎬᏩᏛᎯᏓᏍᏗᎢ.

source: Don't you believe I can do it?
chr: ᏣᏜᏏᏛᎡᎭᏍ ᎡᎵᏊ ᏱᎬᏆᏛᏁᏗ ᎨᏒᎢ?

source: How many nonbelievers are here?
chr: ᎯᎳ ᎾᏂᎠ ᎤᎾᏜᏏᏛᎡᎯ ᎠᏁᏙᎭ?

source: He took revenge when he was cheated.
chr: ᎤᏞᏨ ᎠᏥᎶᏄᎡᏝ.

source: Go away.
chr: ᎤᏟ ᏫᎶᎯ.

source: She's wearing earrings made of gold.
chr: ᎠᏕᎳ ᏓᎶᏂᎨ ᏗᎪᏢᏔᏅ ᏗᏟᎠᏙ ᏚᏟᎠᏓ.

source: Who would admit that he's a hypocrite?
chr: ᎦᎪ ᏱᎪᎯᏳᏓ ᎤᏠᎾᏍᏗ ᎨᏒᎢ?

source: Dewberries are similar to blackberries.
chr: ᎤᏠᏏᏅᏗ ᏥᎩ ᎧᏄᎦᏟ ᎤᏠᏱᎨᎢᏍᏗ.

source: A splinter from a board stuck him in his foot.
chr: ᏯᏖᎾ ᎤᏢᏓᎸᏓ ᎤᏣᏲᎭ ᎤᎳᏏᏕᏂ.

source: I was sick yesterday, but I'm all right today.
chr: ᏒᎯ ᏥᎨᏒ ᎠᎩᏢᎬ ᎠᏎᏅ ᎣᏏᏊ ᎢᎩ ᎪᎯ ᎢᎦ.

source: How many patients are in this hospital?
chr: ᎯᎳ ᎢᏯᏂᎢ ᏧᏂᏢᎩ ᎠᏂᏯᎠ ᎠᎭᏂ ᏧᏂᏢᎩᎢ?

source: That man acts sophisticated.
chr: Ꮎ ᎠᏍᎦᏯ ᎤᏢᏈᏗ ᎤᏤᎸᏐᎢ.

source: Her brother is visiting her for one week.
chr: ᎤᏙ ᎤᏩᏛᎯᏙᎭ ᏒᎾᏙᏓᏆᏍᏗ ᎢᎪᎯᏓ.

source: What does her father do?
chr: ᎦᏙ ᎠᏛᏁᎯ ᎤᏙᏓ?

source: He hunts all day when he goes hunting.
chr: ᎤᏙᏓᏆᏓ ᎦᏃᎭᎵᏙᎰ ᏳᏃᎭᎴᎾ.

source: Do you go to church on Sunday?
chr: ᏕᎯᎳᏫᏤᎪᎢᏍ ᎤᎾᏙᏓᏆᏍᎬ ᎢᎦ?

source: Sometimes I work on Saturday.
chr: ᎢᏴᏓᎭ ᎤᎾᏙᏓᏈᏕᎾ ᏓᎩᎸᏫᏍᏓᏁᎰᎢ.

source: He's coming sometime during the day.
chr: Ꮲ ᎤᏙᏓᏈᏗᏒ ᏓᎦᎷᏥ.

source: They're going to start school Monday.
chr: ᎤᎾᏙᏓᏉᏅ ᏛᎾᎴᏅᎯ ᏓᎾᏕᏠᏆᏍᎬᎢ.

source: You did very well on your exam.
chr: ᎤᏙᎯᏳ ᎣᏍᏓ ᎿᏛᎦ ᎡᏣᎪᎵᏰᏍᎬᎢ.

source: The boy is listening to his grandfather tell stories.
chr: ᎤᏚᏚ ᎧᏃᎮᏢᏍᎬ ᎤᏛᏓᏍᏗ ᎠᏧᏣ.

source: I am standing in the water.
chr: ᎠᎹᏱ ᎠᏆᏚᎭ.

source: What's his uncle's name?
chr: ᎦᏙ ᏚᏙᎠ ᎤᏚᏥ?

source: He wants to rest.
chr: ᎤᏓᏪᏐᎸᏍᏙᏗ ᎤᏚᎵᎭ.

source: He's willing to help anytime.
chr: ᏱᏂᎦᎵᏍᏗᎭᏊ ᎢᏴ ᎤᏛᏅᎢᏍᏙ ᎤᏓᏍᏕᎸᏗᎢ.

source: In the fall the leaves will turn into different colors.
chr: ᎤᎵᎪᎲᏍᏗ ᎢᏴ ᏧᎦᎶᎦ ᏧᏓᎴᏅᏓ ᏧᎵᏑᏫᏓ ᏂᏙᏓᎦᎵᏍᏔᏂ.

source: What kind of soup do you want?
chr: ᎦᏙ ᎤᏍᏗ ᎤᎦᎹ ᏣᏚᎵᎭ?

source: These cantaloupes are really sweet.
chr: ᏙᏳ ᎤᏂᎦᎾᏍᏓ ᎯᎠ ᎠᏂᏩᏒᎩ.

source: It sure got warm today, didn't it?
chr: ᎤᏙᎯᏳ ᎤᎦᎾᏩ ᏂᎦᎵᏍᏓ ᎪᎯ ᎢᎦ, ᏙᎧ?

source: Is the candidate wo is speaking a Democrat?
chr: ᎤᎦᎾᏩᏍ Ꮎ ᎠᏙᎩᏯᏍᎩ ᏥᎦᏬᏂᎭ?

source: I am getting warm a little now. He's sitting by the stove warming himself.
chr: ᎠᎩᎦᎾᏬᏍᎦᏛ ᏍᏗᎩᏓ ᏃᏊ. ᎣᏏ ᎾᎥ ᎤᏬᏝ ᎤᎦᎾᏬᏍᎦ.

source: The song is on the second page.
chr: ᏔᎵᏁ ᎤᎦᏅᏓᏛ ᎪᏪᎳ ᎧᏃᎩᏍᏗ.

source: He's stingy with his watch and won't loan it to anyone. Love your wife.
chr: ᎤᎨᏳᎭ ᏩᏥ ᏝᎴ ᎩᎶ ᏴᎬᏙᎵᏍᏓ. ᎯᎨᏳᏎᏍᏗ ᏣᏍᏓᏴᎲᏍᎩ.

source: That man is really stingy.
chr: ᎤᏙᎯᏳ ᎤᎨᏳᎿ Ꮎ ᎠᏍᎦᏯ.

source: Indians wear feathers on their heads.
chr: ᎠᏂᏴᏫᏯ ᏧᎩᏓᏟ ᏚᎾᏗᎵᎪᎢ.

source: I din't get there until the next morning.
chr: ᎤᎩᏨᏓ ᎢᏴ ᎩᎳ ᏩᎩᎷᏨᎢ.

source: He gets up at dawn when he has to work.
chr: ᎤᎩᏥᏕᏱ ᎠᏗᏗᏍᎪ ᏧᎸᏫᏍᏓᏁᏗ ᏱᎩ.

source: Which one do you like more?
chr: ᎦᏙ ᎤᏍᏗ ᎤᎪᏗ ᏣᎸᏉᏗ?

source: She sells a lot of milk.
chr: ᎤᎪᏗ ᎤᏅᏗ ᎦᎾᏕᎪᎢ.

source: If you wait too long to go, you'll be late.
chr: ᎪᎯᏗᏍ ᎢᎯᎦᏘᏰᏍᏗ ᏤᏅᏍᏗ ᏓᏣᎪᏂᏲᏥ.

source: The old wood is decaying.
chr: ᎠᏓ ᎤᏪᏘ ᎤᎪᏍᎦ.

source: I small something rotten.
chr: ᎪᎱᏍᏗ ᎤᎪᏏᏓ ᎠᎩᏩᏒᎦ.

source: Some people think it is a bad omen to hear a hoot owl close to a building.
chr: ᎢᎦᏓ ᎤᏓᎴᎯ ᎠᏁᎵᏍᎪ ᎤᎫᎫ ᏱᏂᎦᏪᎠ ᎠᏓᏁᎸ ᎾᎥᎢ.

source: Is that man part Cherokee?
chr: ᏣᎳᎩᏍ ᎤᎬᎭᏟ Ꮎ ᎠᏍᎦᏯ?

source: I want money instead.
chr: ᎠᏕᎳ ᎤᎬᏫᏳ ᏓᏆᏚᎵᎭ.

source: Does the chief know you?
chr: ᏦᎵᎩᏍ ᎤᎬᏫᏳᎯ?

source: He has ten acres of land.
chr: ᏍᎪᎯ ᎢᏳᏟᎶᏓ ᎦᏓ ᎤᎭ.

source: He's yawning because he's sleepy.
chr: ᎤᎭᏠᎨ ᎦᏢᏍᎬ ᎢᏳᏍᏗ.

source: I hear a bell ringing.
chr: ᎤᎭᎸᏂ ᎤᏃᏴᎬ ᎦᏛᎩᎠ.

source: His lips are getting dry.
chr: ᏚᎭᏁᎦᎸ ᏚᎧᏲᎯᏎᎭ.

source: There's dew on the ground
chr: ᎦᏙᎯ ᎤᎯᏌᏔ.

source: She doesn’t like to get lonesome.
chr: Ꮭ ᏳᎸᏉᏗ ᎤᎯᏐᏓᏁᏗ.

source: It was lonesome when she left.
chr: ᎤᎯᏐᏛ ᎤᏁᎳᏓ.

source: He became strong by lifting weights.
chr: ᏗᎦᎨᏓ ᏓᏌᎳᏗᏍᎬ ᎤᏟᏂᎩᏓ ᏄᎵᏍᏔᏅᎢ.

source: Write their names down quickly.
chr: ᏚᎾᏙᎥ ᏙᏪᎸᎦ ᎤᏟᏍᏓ.

source: Where does her aunt live?
chr: ᎭᏢ ᏫᎦᏁᎳ ᎤᏠᎩ?

source: I want the same kind of car he has.
chr: ᏓᏆᎴᎳ ᎤᎲ ᎤᏠᏱ ᎠᏆᏚᎵᎭ.

source: Are you going there?
chr: ᎤᎿᏍ ᏖᏏ?

source: Some islands are small.
chr: ᎢᎦᏓ ᏚᎿᎷᏛ ᏧᏍᏗ ᎨᏐᎢ.

source: Leave the dog alone because he's getting mad.
chr: ᏁᎳᎩ ᎩᏟ ᎤᎿᎸᎦᏏ.

source: The man is always angry.
chr: Ꮎ ᎠᏍᎦᏯ ᏂᎪᎯᎸ ᎤᎿᎸᏐᎢ.

source: He's drinking tea made from sassafras root.
chr: ᎧᎾᏍᏓᏥ ᎤᎿᏍᏕᏜ ᎠᎦᏅ ᎠᏗᏔᏍᎦ.

source: Don't chop on the tree roots.
chr: ᏞᏍᏗ ᏕᏡᎬ ᏚᎿᏍᏕᏢ ᏱᏘᎷᏯᏍᎨᏍᏗ.

source: He stubbed his toe on a big rock.
chr: ᏅᏯ ᎤᏔᎾ ᎠᎲ ᎤᎿᏍᏆᎶᎥᎢ.

source: She's picking some possum grapes.
chr: ᎤᏂᎿᏑᎦ ᏕᎦᏕᎠ.

source: He's trimming his toenails with a knife.
chr: ᎭᏰᎵᏍᏗ ᎬᏗ ᏓᏍᏆᎸᏍᎦ ᏚᎿᏑᎦᏢᎢ.

source: This patient has a chill.
chr: ᎯᎠ ᎤᏢᎩ ᎤᎿᏩᏍᏗᎭ.

source: He tore his shirt going under a fence.
chr: ᎤᎿᏬ ᎠᏲᏍᏓ ᎠᏏᎳᏛ ᎦᏄᏴᎯᎲᎢ.

source: He doesn't like for anyone to see his scar.
chr: Ꮭ ᏳᎸᏉᏗ ᎩᎶ ᎤᎪᏩᏛᏗ ᎤᏁᎸᏒᎢ.

source: Are you already in bed?
chr: ᎦᏳᎳᏍ ᏣᏂᎭ?

source: A stump is all that's left of the big tree.
chr: ᎤᏂᏡᎬᎢᏊ ᎢᎦ ᎤᏟᏃᎯᏯ Ꮎ ᎤᏔᎾ ᏥᏡᎬᎢ.

source: He charges one dollar when he fixes a tire.
chr: ᎤᏃᏍᏓ ᏓᎬᏩᎶᏗᏍᎪ ᎠᏢᏗ ᎣᏍᏓ ᏱᏄᏩᏁᎳ.

source: Soldiers wear uniforms.
chr: ᏧᏠᏱᎭ ᏚᏀᏄᏬ ᎠᏂᏲᏍᎩ

source: The rainbow faded when the cloud cleared up.
chr: ᎤᏅᏉᎳᏛ ᎤᏍᎪᎸᏨ ᎤᎶᎩᎸ ᎤᎵᎦᎵᏴᎭ.

source: Go stand in the corner.
chr: ᎤᏅᏏᏴ ᏩᎴᎲᎦ.

source: He took some thick clothing when he went up north.
chr: ᏧᏩᎨᏓ ᏗᎿᏬ ᏚᏅᏒ ᏧᏴᏢ ᎤᏪᎾ.

source: Yesterday I bought a car.
chr: ᏒᎯ ᏥᎨᏒ ᏓᏆᎴᎳ ᎠᎩᏩᏒᎢ.

source: That woman's husband is looking for her.
chr: Ꮎ ᎠᎨᏯ ᎤᏰᎢ ᎤᏲᎭ.

source: He is looking for the watch he lost yesterday.
chr: ᏩᏥ ᏧᏲᎱᏎᎸ ᏒᎯ ᎤᏲᎭ.

source: What's floating on the water?
chr: ᎦᏙ ᎤᏍᏗ ᎤᏲᎷᎭ ᎠᎹᏱ?

source: He has a big horn on his car.
chr: ᎤᏔᎾ ᎤᏲᎾ ᏄᏩᏅᏗ ᏓᏆᎴᎷᎢ.

source: Whenever a Cherokee "catches" a cold, he doesn't catch the cold; rather, the cold catches him.
chr: ᎠᏣᎳᎩ ᎤᏴᏜ "ᏳᏂᏴᎭ" Ꮭ ᎤᏴᏜ ᏱᎦᏂᏱᏍᎪᎢ, ᎤᏴᏜᏍᎩᏂ ᎤᎬᏫᏍᏳᏐ ᎤᏂᏱᏍᎪᎢ.

source: I'm thirsty for cold water.
chr: ᎤᏴᏜ ᎠᎹ ᎠᎩᏔᏕᎩᎠ.

source: Do you vote Republican?
chr: ᎤᏴᏜᏍ ᎯᏁᎩ?

source: I don't feel good. I have a cold.
chr: Ꮭ ᎣᏍᏓ ᏯᏆᏓᏅᏔ. ᎤᏴᏜ ᎠᎩᏂᏱᎭ.

source: Don't choke on it.
chr: ᏞᏍᏗ ᏥᏣᏴᏥᏅᏘᏏ.

source: How many did he drink before he got drunk?
chr: ᎯᎳ ᎢᎦ ᏚᏗᏔᎮ ᎩᎳ ᎤᏴᏍᏓᎡᎢ?

source: I see a drunk man waling this way.
chr: ᎤᏴᏍᏕᏓ ᎠᏍᎦᏯ ᏣᎢᏒ ᏥᎪᏩᏘᎭ.

source: Some drunkard froze to death last winter.
chr: ᎩᎶ ᎤᏴᏍᏕᏍᎩ ᎤᎿᏬᏨ ᎪᎳ ᏥᎨᏒᎢ.

source: He likes to drink strong coffee.
chr: ᎤᏴᏍᏗ ᎧᏫ ᎤᏗᏔᏍᏗ ᎤᎸᏉᏗ.

source: The cat is inside the box.
chr: ᏪᏌ ᎧᏁᏌᎢ ᎤᏣᎠ.

source: They make bread out of wheat.
chr: ᎦᏚ ᎠᏃᏢᏗᏍᎪ ᎤᏣᎴᏍᏗ.

source: A drunk was arrested amon a lot of people.
chr: ᎤᏂᏣᏘ ᏄᎾᏛᏅ ᏴᏫ ᎠᏥᏂᏴᎲ ᎤᏴᏍᏕᏓ.

source: His car is red.
chr: ᎩᎦᎨ ᎤᎵᏑᏫᏓ ᏓᏆᎴᎳ ᎤᏤᎵᎢ.

source: When you say something to him, he grins.
chr: ᎪᏍᏗ ᏱᎪᏎᎳ ᎠᏤᏥᏍᏗᏍᎪᎢ.

source: I ran over a possum last night.
chr: ᎤᏤᏥᏍᏗ ᏥᏯᏗᏅᏔᏅ ᎤᏒ ᏥᎨᏒᎢ.

source: Doesn't he hear his mother calling him?
chr: ᏝᏍ ᏯᏛᎩᎠ ᎤᏥ ᏧᏯᏂᏍᎬᎢ?

source: Have you ever picked cotton?
chr: ᎢᎸᎯᏳᎢᏍ ᎤᏥᎸ ᏣᏕᏓ?

source: Some fishermen use worms when they fish.
chr: ᎢᎦᏓ ᎠᎾᏑᏂᏙᎯ ᎤᏂᏥᏯ ᏓᏅᏗᏍᎪ ᏳᎾᏑᎿ.

source: When he heard a snake rattling, he froze.
chr: ᎢᎾᏓ ᎤᏦᎾᏛ ᎤᏛᎦᎾ ᎤᏯᏅᏒᎢ.

source: Rattlesnakes live in that cave over there.
chr: ᎤᎾᏦᎾᏘ ᎠᏂᏁᎳ ᎠᎨ ᏥᏧᏍᏓᎦᎳ.

source: His handwriting is confusing.
chr: ᎤᏦᏍᏗ ᏚᏬᏪᎳ.

source: Although it rained yesterday, the ground is already dry.
chr: ᏁᎳᎩ ᏧᎦᎿᏅ ᏒᎯ, ᎦᏳᎳ ᎤᎧᏲᏓ ᎢᎩ ᎦᏙᎯ.

source: Walk on a dry place.
chr: ᎤᎧᏲᏛ ᎭᎢᏎᏍᏗ.

source: His face is just hot.
chr: ᎤᏗᎴᎩᏊ ᎤᎧᏛᎢ.

source: His house is in the valley.
chr: ᎤᎨᏓᎵᏴ ᎠᏓᏁᎳ ᏧᏪᏅᏒᎢ.

source: What's that sticking out of your pocket?
chr: ᎦᏙ ᎤᏍᏗ ᎤᎧᏌᏔ ᏣᎳᏩᏛᎢ?

source: He's watching a prisoner so he won't get away.
chr: ᎠᏴᎩ ᎤᎦᏎᏍᏗ ᎤᎵᏘᏍᏗ ᏂᎨᏒᏅ ᎤᎡᎸᏒᎢ.

source: What do goats eat?
chr: ᎦᏙ ᎤᏍᏗ ᎠᏂᎩᏍᎪ ᎤᎾᎦᏐᏣᏁᏓ?

source: Diamondback rattlers are dangerous.
chr: ᎤᎾᎦᏑᏘ ᎠᏂᎾᏰᎩ.

source: She saves watermelon seeds.
chr: ᎬᎩᏍᏗ ᎤᏂᎩᏔ ᏓᎵᏏᏅᏗᏍᎪᎢ.

source: It was foggy this morning.
chr: ᎤᎬᎭᏓ ᎪᎯ ᏑᎾᎴᎢ.

source: Kittens are cute.
chr: ᏪᏌ ᎠᏂᏓ ᎤᏂᎬᎯᏍᏓ ᎨᏐᎢ.

source: He went deer hunting yesterday but he had no luck.
chr: ᎠᏫ ᏚᏯᎸᏒ ᏒᎯ ᎠᏎᏅ ᎤᏉᎸᏒᎢ.

source: His feet are sticking out from under his covers.
chr: ᏧᎳᏏᏕᏂ ᏚᎦᏌᏔ ᏚᎿᏬᏍᏛᎢ.

source: He's lacing up his shoes.
chr: ᏧᎳᏑᎶ ᏕᎧᎸᏌᏛᏍᎦ.

source: He got lost because he didn't know which way to go.
chr: ᎤᎴᏀᎸ ᏝᎮᏃ ᏯᎧᏔᎮ ᎢᏗᏜ ᏭᎶᎯᏍᏗᎢ.

source: He became skinny because he was sick for a long time.
chr: ᎪᎯᏓ ᎤᏢᏨ ᎢᏳᏍᏗ ᎤᎴᏐᏓ ᏄᎵᏍᏔᏅᎢ.

source: You'll be making a mistake if you say that.
chr: ᏣᎵᏓᏍᏗᏍᎨᏍᏗ ᎥᏍᎩ ᏂᎯᏪᏒᎢ.

source: He's going to school in the fall.
chr: ᎤᎵᎪᎲᏍᏗ ᎢᏴ ᏛᎴᏅᎯ ᏓᏕᎶᏆᏍᎬᎢ.

source: Is that snake dead?
chr: ᎤᎵᏬᏨᎢᏍ Ꮎ ᎢᎾᏓ?

source: My brother has curly hair.
chr: ᏦᏍᏓᏓᏅᏟ ᎤᎵᏥᏍᏆᏁᏓ ᎤᏍᏘᎦ.

source: He's taking the fat off the meat.
chr: ᎤᎵᏦᎯᏓ ᏂᎬᏅᏕ ᎭᏫᏲᎯ.

source: She's cleaning some hog intestines.
chr: ᏏᏆ ᏧᎵᎩᏏ ᏕᎦᏅᎦᎵᎭ

source: He's not too weak.
chr: Ꮭ ᎤᏙᎯᏳ ᎤᎵᏍᏗ ᏱᎩ.

source: His grandmother gave him a coat.
chr: ᎤᎵᏏ ᎤᏅᏁᎸ ᎦᏌᎴᏂ.

source: Why is he moaning?
chr: ᎦᏙ ᏧᎵᏰᏗᎭ?

source: She was wearing a wedding ring.
chr: ᏕᎨᎦᏨᏍᏗᏍᎬ ᎤᎾᎵᏰᏑᏍᏙᏗ ᎠᎵᏰᏑᏍᏙ ᎤᎵᏰᏑᏍᏘᎬᎢ.

source: It's cloudy like it's going to rain.
chr: ᎤᎦᎿᏂᏕᎾ ᎢᏳᏍᏗ ᎤᎶᎩᎳ.

source: The clouds are moving fast.
chr: ᎦᏣᏄᎵ ᎠᎢ ᎤᎶᎩᎵ.

source: Something happened to him while he was away. He didn't come back. What's wrong with that dog?
chr: ᎪᏍᏗ ᎤᎵᏍᏓᏁᎸ Ꮲ ᏪᏙᎲ. Ꮭ ᏱᎤᎷᏤᎢ. ᎦᏙ ᎤᎵᏍᏓᏁ Ꮎ ᎩᏟ?

source: When I found out the door was open, I went in.
chr: ᎦᎶᎯᏍᏗ ᎤᎵᏍᏚᎢᏓ ᎨᏒ ᎠᏆᏕᎶᎰᏌ, ᏩᎩᏴᎸᎢ.

source: Those ball players are wearing new caps.
chr: Ꮎ ᎠᎾᎳᏍᎦᎵᏍᎩ ᏗᏤ ᏚᎾᎵᏍᏚᎳ.

source: I guess it wasn't important.
chr: Ꮭ ᎠᏎ ᎤᎵᏍᎨᏓ ᏱᎨᏍ ᎡᎢ.

source: I found a broken broom. He says he's broke.
chr: ᎬᏃᏌᏍᏗ ᎤᎵᏍᏆᎵᏓ ᏥᏴᏩᏔ. ᏧᎵᏍᏆᎵᏓ ᎠᏗᎭ

source: Someone is sticking his head out of the window, but I don't know who it is.
chr: ᎩᎶ ᏦᎳᏂ ᎤᎵᏍᏆᎷᏓ ᎠᏎᏅ Ꮭ ᏯᏆᏅᏔ ᎥᏍᎩ ᎨᏒᎢ.

source: I see him, he's wearing a different hat.
chr: ᏂᎪᎸ ᏱᏥᎪ ᏄᏓᎴ ᎤᎵᏍᏇᏚᎪᎢ.

source: It's really dark tonight.
chr: ᏙᏳ ᎤᎵᏏᎦ ᎪᎯ ᎤᏒᎢ.

source: It's hard to see someone in the dark if he has on a dark shirt.
chr: ᏍᏓᏱ ᎠᎪᏩᏛᏗ ᎤᎵᏏᎬ ᎩᎶ ᎤᎵᏍᎩ ᏳᏄᏩ.

source: I have a yellow colored car.
chr: ᏓᎶᏂᎨ ᎤᎵᏑᏫᏓ ᏓᏆᎴᎳ ᎠᎩᎭ.

source: I'm not allergic to poison ivy.
chr: Ꮭ ᎪᎱᏍᏗ ᏯᏋᏁᎰ ᎤᎸᏓ.

source: I like her because she's friendly.
chr: ᎤᏓᏅᏘᏴ ᎢᏳᏍᏗ ᏥᎸᏉᏗ.

source: She bought six water glasses.
chr: ᏑᏓᎵ ᎢᎦ ᎠᎹ ᏧᏟᏍᏙᏗ ᏧᎸᏌᏗ ᏚᏩᏒᎢ.

source: Do you have a driver's license?
chr: ᏣᎾᎠᏍ ᏓᏆᎴᎳ ᎠᎯᎵᏓᏍᏗ ᎠᏓᎵᏍᎪᎸᏓᏁᎯ ᎪᏪᎵ?

source: The chain broke as he was pulling the car.
chr: ᏓᏆᎴᎳ ᎦᎾᏌᏁᏍᎬ ᏚᎵᎦᎵᏒ ᎤᎾᏓᏕᏒᏓ.

source: Let's go to the ball field.
chr: ᎤᎾᎳᏍᎦᎸᏗ ᎢᏕᎾ.
